Процедура ОбработкаПроведения(Отказ, Режим)
	//Сформировано автоматически, обработатно вручную для визуального улучшения
	
 Движения.ОстаткиМатериалов.Записывать = Истина;
 Движения.СтоимостьМатериалов.Записывать = Истина;
 
 Для Каждого ТекСтрокаПереченьНоменклатуры Из ПереченьНоменклатуры Цикл
  Если ТекСтрокаПереченьНоменклатуры.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Материал Тогда
	  
   // Регистр ОстаткиМатериалов Расход
   Движение = Движения.ОстаткиМатериалов.Добавить();
   Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
   Движение.Период = Дата;
   Движение.Материал = ТекСтрокаПереченьНоменклатуры.Номенклатура;
   Движение.Склад = Склад;
   Движение.Количество = ТекСтрокаПереченьНоменклатуры.Количество;
   
   // Регистр СтоимостьМатериалов Расход
   Движение = Движения.СтоимостьМатериалов.Добавить();
   Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
   Движение.Период = Дата;
   Движение.Материал = ТекСтрокаПереченьНоменклатуры.Номенклатура;
   Движение.Стоимость = ТекСтрокаПереченьНоменклатуры.Количество  * ТекСтрокаПереченьНоменклатуры.Стоимость;
	   
  КонецЕсли;
 КонецЦикла;
КонецПроцедуры

